#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.data.aws_ami_ids.ubuntu: Reading...
module.vpc.data.aws_availability_zones.az_list: Reading...
module.vpc.aws_eip.lb: Refreshing state... [id=eipalloc-00b6f995c40471ac7]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-02ba6a8f897437fde]
module.eks.aws_iam_role.eks_node_role: Refreshing state... [id=eks-node-group-role]
module.eks.aws_iam_role.eks_role: Refreshing state... [id=eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.node_ecr_PullOnly: Refreshing state... [id=eks-node-group-role-20250616084724035200000002]
module.eks.aws_iam_role_policy_attachment.node_ecr_ReadOnly: Refreshing state... [id=eks-node-group-role-20250616084724078600000003]
module.eks.aws_iam_role_policy_attachment.eks_worker_policy: Refreshing state... [id=eks-node-group-role-20250616084724020400000001]
module.eks.aws_iam_role_policy_attachment.eks_elb_Policy: Refreshing state... [id=eks-cluster-role-20250616084724138100000007]
module.eks.aws_iam_role_policy_attachment.eks_policy: Refreshing state... [id=eks-cluster-role-20250616084724108100000005]
module.eks.aws_iam_role_policy_attachment.eks_ebs_Policy: Refreshing state... [id=eks-cluster-role-20250616084724176100000008]
module.eks.aws_iam_role_policy_attachment.eks_ComputePolicy: Refreshing state... [id=eks-cluster-role-20250616084724101400000004]
module.eks.aws_iam_role_policy_attachment.eks_np_Policy: Refreshing state... [id=eks-cluster-role-20250616084724137700000006]
module.vpc.data.aws_availability_zones.az_list: Read complete after 1s [id=eu-west-1]
module.eks.data.aws_ami_ids.ubuntu: Read complete after 1s [id=2055710635]
module.vpc.aws_subnet.prv3_subnet: Refreshing state... [id=subnet-09638282e66332a4c]
module.vpc.aws_subnet.prv2_subnet: Refreshing state... [id=subnet-0b62cbf5f1b1dff9f]
module.vpc.aws_subnet.pub2_subnet: Refreshing state... [id=subnet-02f8a0c444dbeb6cb]
module.vpc.aws_internet_gateway.gw: Refreshing state... [id=igw-03e4df14d61f3a4a9]
module.vpc.aws_subnet.prv1_subnet: Refreshing state... [id=subnet-061902f3da41c820f]
module.vpc.aws_subnet.pub3_subnet: Refreshing state... [id=subnet-0133103110cef558f]
module.vpc.aws_subnet.pub1_subnet: Refreshing state... [id=subnet-06ab72806d072d47a]
module.eks.aws_security_group.eks_node_sg: Refreshing state... [id=sg-029fa5efb24b24ce2]
module.vpc.aws_route_table.nat_routes: Refreshing state... [id=rtb-06aa6f399a9bf1025]
module.vpc.aws_route_table.pub_routes: Refreshing state... [id=rtb-0124dc5ad20e2174e]
module.eks.aws_security_group.eks_cluster_sg: Refreshing state... [id=sg-0c8a2f5e09175d4f2]
module.eks.aws_launch_template.ubuntu_lt: Refreshing state... [id=lt-0f6f651da97ba6438]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-05db3c67cd07d7fff]
module.vpc.aws_route_table_association.pub3_subnet_route: Refreshing state... [id=rtbassoc-0703335d275137317]
module.vpc.aws_route_table_association.pub2_subnet_route: Refreshing state... [id=rtbassoc-03dac877a3b3bf869]
module.vpc.aws_route_table_association.pub1_subnet_route: Refreshing state... [id=rtbassoc-0e848946a7ef3bbce]
module.vpc.aws_route_table.prv_routes: Refreshing state... [id=rtb-0035d1174e8783c54]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=eks-sharks-cluster]
module.vpc.aws_route_table_association.prv1_subnet_route: Refreshing state... [id=rtbassoc-03147e001129e0042]
module.vpc.aws_route_table_association.prv3_subnet_route: Refreshing state... [id=rtbassoc-0d8610936658c86da]
module.vpc.aws_route_table_association.prv2_subnet_route: Refreshing state... [id=rtbassoc-0c64b244bb5a358f1]
module.eks.aws_eks_node_group.eks_nodes: Refreshing state... [id=eks-sharks-cluster:terraform-20250616092245419900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_node_group.eks_nodes is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "eks_nodes" {
      ~ arn                    = "arn:aws:eks:eu-west-1:975049996360:nodegroup/eks-sharks-cluster/terraform-20250616092245419900000001/fecbbc06-2e90-825b-bc03-9929a456eda6" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "eks-sharks-cluster:terraform-20250616092245419900000001" -> (known after apply)
      ~ instance_types         = [] -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "terraform-20250616092245419900000001" -> (known after apply)
      ~ node_group_name_prefix = "terraform-" -> (known after apply)
      ~ release_version        = "ami-0febf61e48289c17d" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-terraform-20250616092245419900000001-fecbbc06-2e90-825b-bc03-9929a456eda6"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      ~ tags                   = {
          + "Name"        = "eks_nodes_group"
            "environment" = "prod"
        }
      ~ tags_all               = {
          + "Name"        = "eks_nodes_group"
            # (1 unchanged element hidden)
        }
      + version                = (known after apply)
        # (4 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0f6f651da97ba6438"
          ~ name    = "ubuntu-eks-nodegroup2025061608474188100000000b" -> (known after apply)
          ~ version = "1" -> "$Latest"
        }

      ~ node_repair_config (known after apply)

      ~ update_config (known after apply)
      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_security_group.eks_cluster_sg will be updated in-place
  ~ resource "aws_security_group" "eks_cluster_sg" {
        id                     = "sg-0c8a2f5e09175d4f2"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "192.168.8.0/24",
                  - "192.168.10.0/24",
                  - "192.168.11.0/24",
                ]
              - description      = "Allow worker nodes to communicate with the cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow worker nodes to communicate with the cluster API"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-029fa5efb24b24ce2",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "eks-sharks-cluster-cluster-sg"
        tags                   = {
            "Name"        = "eks-sharks-cluster-cluster-sg"
            "environment" = "prod"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.eks_node_sg will be updated in-place
  ~ resource "aws_security_group" "eks_node_sg" {
        id                     = "sg-029fa5efb24b24ce2"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow cluster control plane to communicate with nodes"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0c8a2f5e09175d4f2",
                ]
              - self             = false
              - to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = "Allow cluster control plane to communicate with nodes"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10250
            },
            # (1 unchanged element hidden)
        ]
        name                   = "eks-sharks-cluster-node-sg"
        tags                   = {
            "Name" = "eks-sharks-cluster-node-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Adebisea, Action: `pull_request`, Working Directory: ``, Workflow: `Infra Setup CI/CD Pipeline`*